applications/carrier/internal/service/file_fixtures/club_supporter_subscription_refunded_test.txt

( https://overdoll.com )

-------------
Refund Issued
-------------

Hello test user!

As requested, we have refunded the amount *0.10 USD* back to your card.

This refund was for your subscription to *test a club* (https://ci.overdoll.dev/test-club).

You may manage your subscription at any time using the button below.

Manage Subscription ( https://ci.overdoll.dev/settings/billing/subscription/25WqY2AZfmlykwqKhQagxmI9gtd )

Please contact hello@overdoll.com if you have any questions or concerns.

overdoll is a platform for 18+ creators.
Help ( https://overdoll.com/help ) | I'm a creator ( https://overdoll.com/creators )
